[
    {
        "type": "heading",
        "text": "Story Recap"
    },
    {
        "type": "note",
        "text": "▶ ▶ Following the advice of the Chrysos Heirs , I embarked on the trial of Time , only to learn that I had been \"dead\" since the moment I stepped onto Amphoreus . To reclaim the future that had been stolen from me, we pushed onward in pursuit of the Death Titan , Thanatos ."
    },
    {
        "type": "note",
        "text": "▶ ▶ Meanwhile, Anaxa , one of the Seven Sages of the Grove of Epiphany , broke free from the surveillance of the golden threads and actively sought refuge from the Council of Elders . After winning the Council's trust, he ascended Dawncloud with Cerces the Reason Titan who resided within him, and sought an audience with Kephale the Worldbearing Titan."
    },
    {
        "type": "note",
        "text": "▶ ▶ To obtain information about the entrance to the nether realm, Castorice had no choice but to support the Council of Elders in proposing a pause in the Flame-Chase Journey. With the aid of the demigod Cipher , she set out for the ancient city of the dead dragon — Styxia ."
    },
    {
        "type": "note",
        "text": "▶ ▶ Castorice successfully recreated the dead dragon Pollux via alchemy and used its power to return to the nether realm, where she faced Thanatos the Death Titan. She returned both the Titan's Coreflame and the stolen future, restoring the cycle of life and death in Amphoreus."
    },
    {
        "type": "note",
        "text": "▶ ▶ Anaxa's soul met Castorice in the nether realm, where he proved his hypothesis regarding creation. At the citizens' assembly, he cast a pivotal vote and used the charge of blasphemy to thwart the Council of Elders's schemes for power, allowing the Flame-Chase Journey to continue."
    },
    {
        "type": "note",
        "text": "▶ ▶ After returning Cerces 's Coreflame, Anaxa's physical body completely disappeared. With this, the Flame-Chase Journey neared its conclusion, and all eyes turned skyward..."
    },
    {
        "type": "heading",
        "text": "Head to the Vortex of Genesis and recall what came before"
    },
    {
        "type": "mission_description",
        "title": "Mission Description",
        "content": "Since arriving in Amphoreus, each meeting and parting has come in dazzling succession, leaving behind a faint melancholy. Even the ever-spirited (Trailblazer) now stands within the Vortex of Genesis, immersed in memories."
    },
    {
        "type": "note",
        "text": "Collect your thoughts"
    },
    {
        "type": "note",
        "text": "Thanatos's and Cerces's Coreflames have been returned."
    },
    {
        "type": "note",
        "text": "Some time after that..."
    },
    {
        "type": "note",
        "text": "The twelve constellations hover above, overlooking the Vortex of Genesis."
    },
    {
        "type": "note",
        "text": "They embody the twelve Amphorean deities: Fate, Foundation, Creations, and Calamity of this world."
    },
    {
        "type": "note",
        "text": "Now, ten among them have fallen, their Coreflames returned to the origin of genesis. Above you, constellations shimmer, their brilliance echoing the faint slumber of each titan."
    },
    {
        "type": "note",
        "text": "And you... have experienced four ascensions and four partings."
    },
    {
        "type": "choice",
        "text": "\"Strife\"...",
        "children": [
            {
                "type": "note",
                "text": "The Lance of Fury once became the Mad King, plunging the world into ceaseless strife, until your valor brough [ sic ] it to an end."
            },
            {
                "type": "note",
                "text": "And its demigod successor, the undying Mydeimos , chose to bear the title of Kremnos alone, returning home to be crowned as the last line of defense for the holy city."
            },
            {
                "type": "note",
                "text": "Mydei, may your battles know no defeat."
            }
        ]
    },
    {
        "type": "choice",
        "text": "\"Time\"...",
        "children": [
            {
                "type": "note",
                "text": "Back then, the Incarnation of Time entrusted Mem to you at Temple of the Three Fates. Back then, the lively girl with red hair fulfilled her mission, and bid the first farewell."
            },
            {
                "type": "note",
                "text": "Time speaks not of fairness, yet it never stops. And now this power resides in your hands."
            },
            {
                "type": "note",
                "text": "See you tomorrow, Trianne ."
            }
        ]
    },
    {
        "type": "choice",
        "text": "\"Reason\"...",
        "children": [
            {
                "type": "note",
                "text": "Not long ago, the head of the Grove Sages helped you repel the menace that is the black tide."
            },
            {
                "type": "note",
                "text": "And still not long past, that unruly scholar staged one grand performance, granting you a glimpse of this world's truth at the cost of his life."
            },
            {
                "type": "note",
                "text": "Oh, the Incarnation of Reason, at edge of existence, have you found your answer?"
            }
        ]
    },
    {
        "type": "choice",
        "text": "\"Death\"...",
        "children": [
            {
                "type": "note",
                "text": "The prophecy once made the Hand of Shadow choose two, granting one the fate of death. Yet their bond wove a hauntingly beautiful tale that stretched across time."
            },
            {
                "type": "note",
                "text": "At the end, the Incarnation of Death who journeyed from the nether realm to the living world chose to remain in that sea of flowers, retrieving your future."
            },
            {
                "type": "note",
                "text": "At the end of the west wind, we shall meet again, Castorice."
            }
        ]
    },
    {
        "type": "note",
        "text": "What a long journey it's been..."
    },
    {
        "type": "note",
        "text": "Time and again, farewells haven't numbed you. You can't help but wonder — how many more goodbyes will the journey of \"Trailblazing\" entail? You question whether you'll be able to express each \"goodbye\" with heartfelt emotion."
    },
    {
        "type": "note",
        "text": "Your thoughts sink into the ocean... You recall how the Amphoreans cherish epics, using stories to soothe their sorrows. Perhaps you should embrace this way to dispel your melancholy and regain your strength..."
    },
    {
        "type": "note",
        "text": "Then let it begin. Countless words of adventure surge through your mind — you need only to grasp just one to anchor your creation..."
    },
    {
        "type": "note",
        "text": "Don't be influenced by the noise outside, just focus on the keyword in your mind..."
    },
    {
        "type": "note",
        "text": "Mm-hmm, it is indeed difficult. But you should still cling tightly to your inspiration, weaving heartfelt and elegant verses..."
    },
    {
        "type": "note",
        "text": "...Alright, this is an impossible task. Just one glance at your phone, it won't disrupt your thoughts, or so you tell yourself."
    },
    {
        "type": "heading",
        "text": "Head to the Vortex of Genesis and continue your adventure"
    },
    {
        "type": "condition",
        "text": "(Receive a message fromCipher)"
    },
    {
        "type": "note",
        "text": "Messages Cipher Cipher Gray Mystery I had zero time for treasure hunting the last time I was in Styxia Absolutely huge loss Now the River of Souls has mostly retreated... I'm back, baby! There's a big, shiny chest! In the water! I can't use the Miracle Orb, and I can't wade through Your power of time is needed. Come We can do a 70/30 split 30 for you and 70 for me? (Trailblazer) 30 for you and 70 for me? Cipher Exactly, 30 for you and 70 for me (Trailblazer) ? Cipher Pfft, details schmetails. Get here and we'll talk I'm coming. (Trailblazer) Chest? Be there right away. Cipher Quickly! Quickly! Hurry! Cipher"
    },
    {
        "type": "note",
        "text": "You must admit, even during this arduous and struggling low point, there are still those who live joyfully. Cipher's endless, surging desire for wealth seems more turbulent than the waters of Scalegorge Waterscape ."
    },
    {
        "type": "note",
        "text": "Forget the past for now — it only brings sorrow. But sadness has no place in this moment. What you need is the drive to move forward."
    },
    {
        "type": "note",
        "text": "You decide to head to Styxia, where the River of Souls is no longer blocked, to meet up with Catgirl. Hopefully, those glittering, clinking trinkets will, as always... lift your spirits."
    },
    {
        "type": "heading",
        "text": "Head to the \"Dragonbone City\" Styxia and continue your adventure"
    },
    {
        "type": "mission_description",
        "title": "Step Description",
        "content": "Cipher sent a message inviting (Trailblazer) to go treasure hunting in Styxia — could be a welcome change of pace."
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "...Styxia's moonlight is so beautiful.",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "And the River of Souls is so quiet... It's like everything that happened was just a dream. I wonder if Cas is doing okay on the other side? If I write a letter and put it in a drift bottle, will she be able to read it?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "choice",
        "text": "I miss Castorice too...",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "No. No! This shouldn't be so depressing!",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "Now's not the time to feel down.",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "... You're right. We promised Cas that we'd continue the Flame-Chase Journey, so we can't let her worry.",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "Now's not the time to feel down. We gotta pull ourselves together!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "By the way, it was Miss Cipher who asked us to come here, but where has she gone...?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "...Huh?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "choice",
        "text": "What's that sound?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "I don't know, but this aura... feels so familiar.",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "Is there someone else here?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "Yes, and this aura... feels so familiar.",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "▶ ... (Trailblazer), let's go check it out together. Be very careful...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "I... I have a bad feeling about this.",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "heading",
        "text": "Investigate the source of the strange noise"
    },
    {
        "type": "condition",
        "text": "(Approach the marked location)"
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "Hey, what's that on the ground? Should we pick it up...?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "Careful... Careful...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "It's... a piece of black cloth?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "Now, where have I seen this before...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "choice",
        "text": "It's the Flame Reaver ...",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "Wh—What? How could they be here?",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "Did someone rip off a piece of my clothes?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "Wha— No. Your clothes are perfectly fine!",
                "audio_url": null,
                "is_unavailable": false
            },
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "Could this be from... the Flame Reaver's cloak!? Why is it here?",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "Mem! Memi!!!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "▶ — (Trailblazer), look out!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "choice",
        "text": "Mem, get ready —",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "Wait! We both know what this thing can do...",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "You want the pink puppy, don't you?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "I — What? Now I'm sad! This isn't the time for jokes —",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "Is it finally time... for me to bow out?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "D—Don't give up just like that!",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "Let's try our best to deal with them for now, and we'll slip into the past with Time's power as soon as we can!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "The River of Souls...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "Is full of fish... Big and delicious.",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "What.",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "The Flame-Chase Journey... stops...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "Meow... meow...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "M—Meow?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "note",
        "text": "...What's happening?"
    },
    {
        "type": "choice",
        "text": "Is this meant to be a riddle?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "I—I don't understand this language at all. Am I hallucinating...?",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "The Flame Reaver's gone mad. The end.",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Mem",
                "line": "W—We already knew about the mad part! But are we still in danger...?",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "Hehehe... hehehehehe...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Flame Reaver",
        "line": "...Hehehahahahahahha!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "Ahahahahaha... Sorry. I couldn't pass on the chance to give you two a good scare!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "note",
        "text": "So it's you! Cipher!"
    },
    {
        "type": "note",
        "text": "What a terrible person. Let's leave."
    },
    {
        "type": "note",
        "text": "This Cipher must be fake too. Run!"
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "Ah! Don't run! I'm the real Cipher! The real one!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "C'mon, don't be upset. I'm just giving you a kind reminder that Amphoreus isn't safe at all. The whole place is full of dangers, including that swordmaster... Make sure you stay on your toes, no matter where you are!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "choice",
        "text": "So, you're playing both good cop and bad cop.",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Cipher",
                "line": "Hey, I'm just making it up to you. You'd do the same in my shoes.",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "Well, ain't I grateful for the reminder.",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Cipher",
                "line": "Hey, I'm just making it up to you. You're not gonna hold that over me, are you?",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "I'm so strong that I don't need your reminder.",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Cipher",
                "line": "Really? But just a minute ago that gray hair of yours was all standing up, you were so scared.",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "So... was that a Flame Reaver disguise? Or a magic trick? It looked so real... Is that the power of the Trickery demigod ?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "Disguise? No no no, it's not as simple as that. Lemme think about how to explain this...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "For example, what did you think when you realized that piece of cloth came from the Flame Reaver's cloak?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "Hmm... We thought that maybe the Flame Reaver was around here somewhere?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "That's right. And then you heard some footsteps. What did you think when that happened?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "Well, we thought it must be the Flame Reaver coming this way...?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "Yep, exactly. I just used some hints and mental suggestions to help you believe in a lie...",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "\"Lies\" are what Zagreus is best at. If everyone believes in a lie, then it becomes reality!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Mem",
        "line": "A power to make lies into reality... That's got all my hairs standing up!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "choice",
        "text": "Nice! Now I know your secret!",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Cipher",
                "line": "I sure love your arrogance, Gray Mystery~",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "And... you're telling us everything like that?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Cipher",
                "line": "You think I might be lying? Pfft. No need.",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "The seamstress trusts you for a reason. Someone as honest as you couldn't trick me even if you wanted to, so there's no harm in telling you.",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "Besides, we still need to team up to go treasure hunting, right? Let's wrap up here. It's time to get going~",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "...Oh? Was that your teleslate ?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "condition",
        "text": "(Receive a message fromPhainon)"
    },
    {
        "type": "note",
        "text": "Messages Phainon Phainon (Trailblazer), did you rest well? I came during the Lucid Hour, and you seemed asleep, so I didn't wake you up But I can't stay idle in the current circumstances I feel it's time to continue our special training. Let's go to the Grove, shall we?"
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "Heh, aren't you a popular one? But I got to you first, so help me with the treasures, and then I'll send you two to the Grove.",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "choice",
        "text": "Why do you need so much money anyway?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Cipher",
                "line": "Curiosity killed the cat, you know? Do you think I'll spend it all? Pfft. That's so not why I hunt for treasures.",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "choice",
        "text": "Gonna go live handsomely somewhere after this?",
        "children": [
            {
                "type": "dialogue",
                "speaker": "Cipher",
                "line": "Live handsomely? You mean, spend all this money? Pfft. That's so not why I hunt for treasures.",
                "audio_url": null,
                "is_unavailable": false
            }
        ]
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "Don't forget. I'm a demigod too, and there's a line reserved for me in that stupid prophecy as well... \"You shall walk with greed, and die over petty change.\"",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "But I don't believe in that. As long as I keep collecting treasures, then I won't need to care about petty change. And as long as I don't hurt other people when I get what I want, I won't be \"walking with greed\" — right? Isn't that simple?",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "So, as long as I keep going down this path... all those predestined prophecies and fates will never catch up to me!",
        "audio_url": null,
        "is_unavailable": false
    },
    {
        "type": "dialogue",
        "speaker": "Cipher",
        "line": "Phew. That was a long speech. I'm getting thirsty at this rate! The treasures of Styxia aren't gonna float up on their own. Come on, Gray Mystery, show me what the authority of \"Time\" can do!",
        "audio_url": null,
        "is_unavailable": false
    }
]